Laboratorios_Unidad3/14_11_25clientesSW_ChristianHinojosa/clienteSW_Javascript/suma.html

<!DOCTYPE html>
<html>
<head>
    <meta charset="utf-8">
    <title>Cliente Web SOAP - Suma</title>
</head>
<body>
    <center>
        <h1>Suma - WS</h1>
        <h2>Método: Suma(num1, num2)</h2>

        <form onsubmit="realizarSuma(event)">
            <label>Número 1: </label>
            <input type="number" id="n1" required><br><br>

            <label>Número 2: </label>
            <input type="number" id="n2" required><br><br>

            <button type="submit">Calcular</button>
        </form>

        <h3 id="resultado"></h3>
    </center>

<script>
function realizarSuma(event){
    event.preventDefault();

    let num1 = document.getElementById("n1").value;
    let num2 = document.getElementById("n2").value;

    const url = "http://localhost:56791/WebServices/WS_Server.asmx";

    const xml = `
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                       xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                       xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <Suma xmlns="http://tempuri.org/">
              <num1>${num1}</num1>
              <num2>${num2}</num2>
            </Suma>
          </soap:Body>
        </soap:Envelope>`;
    
    fetch(url, {
        method: "POST",
        headers: {
            "Content-Type": "text/xml; charset=utf-8",
            "SOAPAction": "http://tempuri.org/Suma"
        },
        body: xml
    })
    .then(r => r.text())
    .then(xmlText => {
        const parser = new DOMParser();
        const xmlDoc = parser.parseFromString(xmlText, "text/xml");
        const valor = xmlDoc.getElementsByTagName("SumaResult")[0].textContent;

        document.getElementById("resultado").innerHTML =
            `Resultado: ${valor}`;
    })
    .catch(error => alert("Error: " + error));
}
</script>

</body>
</html>
